{
    "Development Engineer - Laboratories": [
        "Uncompromising safety attitude",
        "Master's degree in chemistry",
        "Analytics skills. MS Excel",
        "Self-driven"
    ],
    "Data Analyst": [
        "Master's degree in statistics",
        "Basic statistical tools e.g. R, Python, STATA, Excel",
        "Experience with Microsoft PowerBI",
        "Good interaction and cooperation skills",
        "Analytical approach to work and strong ability to adopt new work tools",
        "Ability to clearly visualize and present information",
        "Knowledge of statistical methods",
        "Interest in Microsoft Azure's cloud-based analysis tools",
        "Familiarity with accessibility, data protection and databases"
    ],
    "HVAC designer": [
        "Master's degree in HVAC engineerig",
        "About one year of experience in HVAC engineering",
        "Knowledge of building regulations and experience, especially in renovation projects",
        "Experience with Magicad"
    ],
    "Mechanical design engineer": [
        "Several years of relevant work experience",
        "M.Sc. or B.Sc. degree in Mechanical Engineering",
        "Strong CAD proficiency (we use Solidworks)",
        "Previous experience in sheet metal, welded steel structure and layout design",
        "Great interacting and team working skills",
        "Experience with PDM systems (we use Solidworks PDM)",
        "Experience with piping design and process components",
        "Experience with hydraulic systems and pressure vessels",
        "Experience with design for additive manufacturing (DfAM)",
        "Experience in electrical industry"
    ],
    "Logistics specialist": [
        "education in Business management or Logistics",
        "3-5 years of previous customer service experience in international logistics",
        "strong MS Office skills",
        "fluent skills of business English, both spoken and written. Knowledge of other languages is an advantage",
        "ability to work independently and skills to organize work and tasks",
        "strong communication, documentation, and presentation skills",
        "ability to multitask and effective problem-solving skills"
    ],
    "Head of School": [
        "Minimum of Master's Degree in Education",
        "Experience in working with the Finnish education system",
        "Previous experience and proven success in a school leadership role (e.g., Principal/Vice Principal)",
        "Strong financial and organizational, human resource, marketing, and management skills",
        "Proven experience and expertise with the school's academic programs",
        "Strong leadership in pedagogical approaches",
        "Educational or professional experience in a culturally diverse environment",
        "Experience in technology-based educational solutions",
        "SISU mindset",
        "Unimpeachable integrity",
        "Strong educational leadership",
        "Managerial expertise",
        "Personal qualities of warmth, approachability, empathy, charisma, visibility, etc.",
        "Community-minded and a community-builder",
        "Visionary and strategically minded",
        "A fluent communicator in English verbally and in writing",
        "International experiences",
        "Student-centered: Connects with and knows their students, interested in their aspirations",
        "Financial acumen",
        "Adept at staff recruitment"
    ],
    "Plant Manager": [
        "MSc or BSc in engineering, or studies in chemistry or biotechnology",
        "10+ years of industrial biotech or related industry experience and 5+ years of progressive experience in operations/plant leadership roles",
        "Demonstrated leadership, collaboration and communication skills",
        "Proven ability to lead cultural change and create winning teams",
        "Results oriented mindset with strong customer and business acumen",
        "Working with a sense of urgency - timeline & actions driven"
    ],
    "Chemist": [
        "Have a Master's degree in Chemistry or Chemical Engineering.",
        "Have relevant work experience in chemical industry or process industry production plants for at least 5 years.",
        "Have experience in managerial position.",
        "Be able to think critically, have cooperation skills, willingness to develop yourself and capability to see the whole picture."
    ],
    "Factory Logistics Engineer": [
        "A few years' experience preferably related to logistics and / or operations",
        "A proven track record in process improvement and hands-on approach",
        "Proficiency using MS Office Tools (PowerBI, Excel, PowerPoint etc.)",
        "Understanding of quality management and processes, such as Lean Six Sigma, 8D, Kaizen",
        "Knowhow of manufacturing processes is seen as an advantage, as well as understanding of ERP systems and SAP experience (especially QM module)",
        "B.Sc. or M.Sc. degree in Engineering or a suitable commercial education"
    ],
    "Data Scientist": [
        "Two years of work experience in Data Science tasks",
        "Experience with the following technologies: Data Warehousing, Google Cloud / Azure, MongoDB / Big Data"
    ],
    "Game Designer": [
        "Previous experience from relevant roles",
        "Mathematical skills and solid Excel know-how",
        "Understanding of free-to-play (F2P) mechanics and a passion for mobile games, especially RPGs",
        "Careful and detail-oriented approach to number tweaking",
        "An organized approach to planning and the ability to make a case for your designs",
        "Great teamwork ethic and solid communication skills in English"
    ],
    "Validation & Testing Engineer": [
        "Engineering degree in electronics, electrics or corresponding field",
        "Background with some years of working experience",
        "Practical assembly skills",
        "Basic understanding of how electronic devices work and how they are composed, including understanding of the electrical drawings",
        "Good communication and team working skills",
        "Role requires good English skills",
        "Quality-driven mindset",
        "Basic knowledge of the Linux and/or Windows"
    ],
    "Electrical Engineer": [
        "Background in designing DC systems, electronics design, and sourcing",
        "Expertise in designing the wirings for scalable manufacturing",
        "Knowledge of reliability analysis and capability to find alternatives when something doesnt work out",
        "Conducting simulations and tests to ensure the performance and reliability of electrical systems and components",
        "Analyzing data and technical specifications to determine the feasibility and cost-effectiveness of proposed electrical systems and designs",
        "Overseeing the installation, maintenance, and repair of electrical systems and equipment",
        "Degree in electrical or electronics engineering.",
        "Experience in organizing work independently",
        "An analytical and calm approach to problem-solving",
        "Capability to form evidence-based opinions for decision-making."
    ],
    "Finance Specialist": [
        "Has a basic experience of working with Source to Pay processes (e.g. Procurement, Accounts Payable etc.)",
        "Has are a proactive person with result-oriented way of working and you enjoy working in a cross-cultural professional community",
        "Has at least basic SAP ERP skills (e.g. FI/CO or MM)",
        "Has are confident with data analytics tools (e.g. PowerBI or Excel)",
        "Has excellent written and verbal communication skills in English",
        "Finnish or German language skills are an asset",
        "Knowledge of tools like SAP Ariba or Basware P2P is an asset"
    ],
    "Commodity Analyst": [
        "Has minimum 3 years of experience in commodity markets, preferably in European gas markets",
        "Has a Master's degree in engineering, math, physics, or economics",
        "Has are a strong team player with excellent communication skills",
        "Has up-to-date knowledge of relevant developments and trends in the energy sector",
        "Has outstanding analytical and problem-solving skills and strong analytical background",
        "Has preferably computer and data-management experience, i.e. databases and SQL",
        "Has a curious, innovative, and forward-looking mindset",
        "Has are fluent in English. Ability to communicate in Finnish or other Nordic language is an asset"
    ],
    "Software Engineer": [
        "At least three years' experience of relevant software engineering experience",
        "B.Sc. or M.Sc. degree, preferably in Computer Science",
        "Excellent hands-on command of your choice of modern software technology, patterns and frameworks, databases and related development tools",
        "Experience and interest in security development, e.g., OWASP ASVS or MASVS framework, network security and cryptography",
        "A drive to learn new technologies and work in a collaborative, test-driven, and agile development",
        "Fluent professional communication skills in English",
        "Professional and quality-centric approach on facing and solving problems",
        "At least 2 years of experience as a Java Engineer",
        "Knowledge of Scala",
        "Working experience with Spark platform",
        "Strong knowledge of data structures and algorithms",
        "Experience with unit testing and TDD",
        "Experience in CI tools and frameworks (Git, Jenkins, SBT)",
        "Fluent English is necessary to work in an international work environment",
        "being agile",
        "working with multiple time zones",
        "sharing knowledge drive",
        "Experience with Scala",
        "Python, or any other development language experience",
        "Developers knowledge/familiarity with: AWS; docker; Kubernetes",
        "experience with more than one stage of Software Development lifecycle"
    ],
    "IT Architect": [
        "You have a Master's degree in Information Technology or an equivalent degree",
        "You have target and result orientated mindset to represent changes and to achieve goals",
        "You have proven track record of designing IT systems/solutions",
        "You are capable to visualize and document use cases for options as well as pitching",
        "You have experience of cyber security technologies available in market",
        "You have experience of enterprise architecture concepts",
        "You have a professional experience of working in an international environment in corporate level companies",
        "You have good communication skills, primarily in English"
    ],
    "Full-Stack Developer": [
        "Deep understanding of full-stack development both front- and back-end",
        "Experience with some of the technologies that we work with: Kotlin, C#/F#, Rust and modern front end technologies such as React, Angular, Svelte or Vue",
        "Overall understanding of tech, but also the ability to share technical knowledge with other stakeholders",
        "Skill to produce high-quality and well-maintainable code",
        "Understanding of most relevant cloud technologies is considered as a plus",
        "Ability to work independently and flexibly in varying environments",
        "A smart, calm and analytic approach to often complex problems",
        "Open-minded and problem-solving attitude",
        "Prior consulting or in-house experience",
        "Java, Spring framework",
        "Python",
        "React, JavaScript, TypeScript",
        "Node.js",
        "HTTP(S), REST, WebSocket",
        "SQL",
        "Linux, Windows",
        "Git, Jenkins",
        "at we expect from you",
        "Strong experience in full-stack software development",
        "Capability to learn fast",
        "Excellent English skills, both spoken and written",
        "Strong problem-solving skills",
        "Good teamwork and social skills",
        "Ability to work systematically and independently",
        "Good communication skills",
        "M.Sc. in computer science or similar knowledge",
        "Commitment to high quality",
        "Positive attitude",
        "A few years of experience with software development",
        "Skills in one or more technologies, such as JavaScript, Node.js, Java, and SQL",
        "Fluent in English",
        "A curious team player who isn't afraid to dive into the deep end and get things rolling!",
        "Skills in SAP UI5/Fiori (UI Developer)",
        "Experience of SAP Business Technology Platform (BTP), AWS, Azure and Google Cloud platforms"
    ],
    "Frontend Developer": [
        "good experience of working as part an agile software team",
        "good knowledge of Vue 3, TypeScript, NodeJS, Java17 and Spring Boot development",
        "good knowledge of developing applications that take usability and accessibility seriously",
        "good knowledge of version control system use (e.g. GitLab)",
        "good communication skills (in English and Finnish, Finnish skills are an asset)",
        "good collaboration skills",
        "a Master's degree in Computer Science or similar, or equivalent work experience",
        "We also value prior experience on MongoDB, RabbitMQ, Docker, Kubernetes, REST APIs and CI/CD-tools (DevOps operations)"
    ],
    "Cloud Software Developer": [
        "You have good experience on at least one cloud platform (Google Cloud, AWS, or Microsoft Azure), and you may have already completed some of these certifications",
        "In addition, it's beneficial that you are interested in microservice or serverless architectures. You may be familiar with Container technologies and orchestration (Docker, Kubernetes)",
        "It is beneficial that you also have some experience in some of the following technologies: TypeScript/JavaScript, Go, C#./NET, Python, or Front-end frameworks such as React/Vue/Angular.",
        "Ability to work independently and flexibly in varying environments",
        "A calm and analytic approach to often complex problems",
        "Open-minded and problem-solving attitude"
    ],
    "Linux Software Developer": [
        "Experience in embedded software development and linux environment",
        "Knowledge on some of the technologies that we work with: C++, Qt and QML",
        "Deep overall understanding of tech, but also a capability of sharing your technical knowledge to others",
        "Passion towards technologies and boldness to try new ways to do things",
        "Ability to work independently and flexibly in varying environments",
        "A smart, calm and analytic approach to often complex problems",
        "Open-minded and problem-solving attitude"
    ],
    "Automation Engineer": [
        "Developing a C++ middle-ware to front-end functionality allowing the inter-operability with other ABB Marine & Ports control systems (OPC-UA, Modbus, CAN bus based communication)",
        "Collaboration with the UI/UX designers and backend developers",
        "Bring on board openness to learn and remain eager to ingest and propose good development and quality practices",
        "Experience in C++ development in embedded and time critical applications",
        "Experience in the Qt framework and the QML is additional plus",
        "Familiarity with the industrial protocols such as OPC-UA, Modbus, Profibus, CAN bus or similar is an advantage",
        "Strong oral and written communication skills in English",
        "Hands-on expertise and degree in machine or electrical automation",
        "General interest and expertise in PLC programming and robotics",
        "Prior experience from independent projects",
        "Ability to work independently and flexibly in varying environments",
        "A calm and analytic approach to often complex problems",
        "Open-minded and problem-solving attitude"
    ],
    "Data Engineer": [
        "Proficiency in coding, databases and experience with modern software development patterns, including the following: distributed computing, data processing pipelines, and information security",
        "Willingness to work with technologies such as Python, Kubernetes, SQL, Kafka, Spark, MLflow and similar",
        "Solid Linux skills and platform management experience",
        "An enthusiasm and a desire to take responsibility for the progress of projects and get things done",
        "The ability for independent planning and decision-making",
        "Good interactive skills and fluent proficiency in English",
        "We also appreciate if you have experience on cloud platforms"
    ],
    "HSE Technician": [
        "Relevant education or relevant years of experience",
        "Experience in concrete manufacturing and technological control",
        "Experience with self-compacting concreteExperience with security procedures",
        "Knowledge of construction techniques (materials, systems and construction processes)",
        "Know and apply the quality control system as well as standards and specifications",
        "Proactive profile with doer attitude and problem-solving skills",
        "Cooperative working style",
        "Resolution of possible technical issues",
        "Ability to communicate proficiently using both Finnish and English",
        "Experience with precast concrete/manufacture processes",
        "Previous experience working in HSE sector",
        "Work experience in construction control and supervision services",
        "Knowledge of quality processes in relation to precast concrete infrastructures",
        "Higher level courses in occupational risk prevention",
        "Postgraduate or degree in health and safety coordination"
    ],
    "Test Automation Developer": [
        "Experience in QA and Test automation",
        "Experience in automation testing tools, such as Robot Framework, Cucumber etc.",
        "DevOps: CI (Jenkins, CircleCI), GitHub, Docker, Selenium",
        "Knowledge in programming languages: Python, C++, Java",
        "Web technologies: HTML5, CSS, PHP, JavaScript, MySQL",
        "Linux & Windows",
        "A will to learn new every day. As a Vaistoneer this is perhaps the most important thing!",
        "Possibility to travel occasionally is considered a plus."
    ],
    "Supplier Quality Engineer": [
        "Suitable technical background (e.g. B.Sc., M.Sc.), material technology preferred",
        "At least 5 years' experience in supplier quality or relevant area",
        "You are qualified in using part certification processes and vendor quality measures as well as show strong knowledge of quality control methods, tools and techniques",
        "Innovative and strategic thinking style with strong problem-solving skills",
        "Capability to work independently and in cross-functional teams",
        "A high-level performance in challenging situations",
        "Fluent written and spoken English is essential",
        "Willingness to travel",
        "IATF 16949 and VDA6.3",
        "Quality and/or process auditor experience",
        "Proficiency of automotive quality tools APQP, PPAP, FMEA, CP, MSA, SPC etc.",
        "Problem solving of 8D, FTA and RCA",
        "German language would be an asset"
    ],
    "R&D Specialist": [
        "An attitude for delivering results in a fast-paced environment",
        "Eagerness to learn fast, to question things, and approach unknowns with curiosity",
        "The mindset of coaching other team members and sharing best practices",
        "Strong communication skills in English (Finnish is a nice bonus)",
        "Ability to prototype and innovate",
        "Electronics soldering and measuring experience",
        "Technical education from the electronic/measuring/maintenance area",
        "Previous work experiment is not mandatory",
        "Basic electronic manufacturing process understanding",
        "Ability to test and analyze electronics and transfer that knowledge to production",
        "Experience with PADS or other electronic CAD is a nice bonus"
    ],
    "Process Metallurgist": [
        "Suitable Master's degree in Chemical/Metallurgical/Process Engineering",
        "Completed courses in HSC Sim",
        "Fluent English skills",
        "Ability to travel abroad occasionally"
    ]
}
